In [1]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [3]:
series = pd.Series([4,8,15,16,23,42])

In [4]:
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [5]:
l = [1,2,3,4,5,6,7,8,9,10]

In [6]:
series  = pd.Series(l)

In [7]:
series

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [8]:
df = pd.DataFrame({"Name": ['Alice','Bob','Claire'],
                   "Age" : [25,30,27],
                   "Gender" : ['Female','Male','Female']
                  })

In [9]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Data frame is a type of data structure which can store multiple columns and dimension whereas series just store 1-D arrays.

In [10]:
df = pd.DataFrame({"Name": ['Alice','Bob','Claire'],
                   "Age" : [25,30,27],
                   "Gender" : ['Female','Male','Female']
                  })
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [11]:
l = [1,2,3,4,5]
series  = pd.Series(l)
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [12]:
df = pd.DataFrame({"Name": ['Alice','Bob','Claire'],
                   "Age" : [25,30,27],
                   "Gender" : ['Female','Male','Female']
                  })

In [13]:
df.head() # it used to have a visual represntation of the data from the top

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [14]:
df.tail() # it used to have a visual represntation of the data from the bottom

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [15]:
 df.dtypes  # it gives all the datatypes of the column

Name      object
Age        int64
Gender    object
dtype: object

In [16]:
df.columns  # It gives the columns that a dataframe has.

Index(['Name', 'Age', 'Gender'], dtype='object')

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

DataFrame and the Panel both are mutubale and their size can be decreased or increased.
The size of the Series cannot be changed once declared.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [17]:
series1 = pd.Series([1,2,3,4,5])
series2 = pd.Series([6,7,8,9,0])

In [18]:
df1 = pd.DataFrame({ "series 1" : series1,
                     "series 2" : series2
})

In [19]:
df1

   series 1  series 2
0         1         6
1         2         7
2         3         8
3         4         9
4         5         0